In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv('C:/Users/USER/Desktop/example.csv')

In [3]:
data

   Unnamed: 0 first_name last_name  age  preTestScore  postTestScore
0           0      Jason    Miller   42             4             34
1           1      Molly  Jacobson   52            24             40
2           2      Kyrie    Irving   36            31             57
3           3       Jake    Milner   24            40             62
4           4        Amy     Cooze   73            22             70

In [4]:
data2=data

In [7]:
data2.rename(columns={'A':'F'})

   Unnamed: 0 first_name last_name  age  preTestScore  postTestScore
0           0      Jason    Miller   42             4             34
1           1      Molly  Jacobson   52            24             40
2           2      Kyrie    Irving   36            31             57
3           3       Jake    Milner   24            40             62
4           4        Amy     Cooze   73            22             70

In [8]:
data['date1'] = pd.Timestamp('2019-03-21')

In [9]:
data

,Unnamed: 0,first_name,last_name,age,preTestScore,postTestScore,date1
0,0,Jason,Miller,42,4,34,2019-03-21
1,1,Molly,Jacobson,52,24,40,2019-03-21
2,2,Kyrie,Irving,36,31,57,2019-03-21
3,3,Jake,Milner,24,40,62,2019-03-21
4,4,Amy,Cooze,73,22,70,2019-03-21

In [10]:
data['year'] = data['date1'].dt.year

In [11]:
data['month'] = data['date1'].dt.month

In [15]:
data['date_next'] = data['date1'] + pd.offsets.MonthBegin()
data['date2'] = pd.Timestamp('2030-03-21')
data['months_between'] = data['date2'].dt.to_period('M') - data['date1'].dt.to_period('M')
data

,Unnamed: 0,first_name,last_name,age,preTestScore,postTestScore,date1,year,month,date_next,date2,months_between
0,0,Jason,Miller,42,4,34,2019-03-21,2019,3,2019-04-01,2030-03-21,132
1,1,Molly,Jacobson,52,24,40,2019-03-21,2019,3,2019-04-01,2030-03-21,132
2,2,Kyrie,Irving,36,31,57,2019-03-21,2019,3,2019-04-01,2030-03-21,132
3,3,Jake,Milner,24,40,62,2019-03-21,2019,3,2019-04-01,2030-03-21,132
4,4,Amy,Cooze,73,22,70,2019-03-21,2019,3,2019-04-01,2030-03-21,132

In [7]:
import pandas as pd
dd = pd.DataFrame({'x': [1,2,3,4,5],'y': [2,4,6,7,8]})
dd

   x  y
0  1  2
1  2  4
2  3  6
3  4  7
4  5  8

In [8]:
dd.rename(columns={'x':'Q'})
dd

   x  y
0  1  2
1  2  4
2  3  6
3  4  7
4  5  8

In [9]:
dd1 = dd.sort_values(['x','y'])
dd1

   x  y
0  1  2
1  2  4
2  3  6
3  4  7
4  5  8

In [10]:
dd1['z'] = [0,4,6,1,3]
dd1.rename(columns = {'x':'Q'})
dd1

   x  y  z
0  1  2  0
1  2  4  4
2  3  6  6
3  4  7  1
4  5  8  3

In [11]:
dd1.sort_values('z')

   x  y  z
0  1  2  0
3  4  7  1
4  5  8  3
1  2  4  4
2  3  6  6

In [1]:
import pandas as pd
import numpy as np
a=pd.DataFrame({'x1':[9,5,8,0,3],'y1':[5,3,0,7,1]})
a

   x1  y1
0   9   5
1   5   3
2   8   0
3   0   7
4   3   1

In [4]:
a.rename(columns={'x1':'x2'})
a

   x1  y1
0   9   5
1   5   3
2   8   0
3   0   7
4   3   1

In [12]:
str="python"

In [13]:
strlength=len(str)
rst=str[strlength::-1]
rst

'nohtyp'

In [10]:
sentence = "The cat is brown"
q = "cat"
 
if q == sentence:
    print('strings equal')
 
if q in sentence:
    print(q + " found in " + sentence)

cat found in The cat is brown

In [19]:
if rst==str:
    print("true")
else:
    print("false")

false

In [2]:
aa=[12,0,9,2,35,576,12]

In [36]:
def ppp(aa):
    b=[]
    i=0
    for a in aa:
        c=(aa[i]*aa[i+1])
        b.append(c)
        i+=1
        if i+1 >= len(aa):
            break
    return(max(b))

In [37]:
ppp(aa)

20160

In [38]:
statues=[6,2,3,8]

In [52]:
sss=sorted(statues)

In [60]:
i=0
b=[]
for a in sss:
    if len(sss)==1:
        print(0)
    else:
            c=sss[i+1]-sss[i]-1
            b.append(c)
            i+=1
            if i+1>=len(sss):
                break
print(sum(b))

3

In [61]:
a=[[0,1,1,2], 
 [0,5,0,0], 
 [2,0,3,3]]

In [70]:
import pandas as pd
b=pd.DataFrame(a)

In [75]:
b.iloc[0,3]

2

In [76]:
aa=[0,7,2,1,3,4]

In [78]:
def mexfunction(s,upperBound):
    found=-1
    for i in range(upperBound):
        if i not in s:
            found=i
            break
        else:
            found=upperBound
    return found

In [79]:
mexfunction(aa,10)

5

In [80]:
aa[:]

[0, 7, 2, 1, 3, 4]

In [83]:
aa[-6]

0

In [85]:
aa[1:-1]

[7, 2, 1, 3]

In [88]:
a = [3, 4, 2, 4, 38, 4, 5, 3, 2]

In [90]:
def listBeautifier(a):
    res = a[:]
    while res and res[0] != res[-1]:
        a,*res,b = res
    return res

In [91]:
listBeautifier(a)

[4, 38, 4]

In [94]:
s="""ads"""

In [95]:
s

'ads'

In [104]:
name = "i\tam a ironman"
print(name.expandtabs(tabsize=7))

i      am a ironman

In [1]:
def permutationCipher(password, key):
    table = maketrans(password,key)
    return password.translate(table)

In [5]:
password="iamthebest"
key="zabcdefghijklmnopqrstuvwxy"

In [7]:
permutationCipher(password, key)

NameError: name 'maketrans' is not defined

In [11]:
import string
table=password.maketrans(string.ascii_lowercase,key)

In [13]:
password.translate(table)

'hzlsgdadrs'

In [4]:
for i in range(1,6):
    print(i)

1
2
3
4
5

In [1]:
a=123

In [3]:
class Solution:
    def reverse(self, x: int) -> int:
        a=str(x)
        return int(a[::-1])

In [8]:
b=str(a)
b

'123'

In [9]:
b[0]

'1'

In [11]:
b[:0:-1]

'32'

In [12]:
b[1:]

'23'

In [14]:
int('-'+b[1:])

-23

In [15]:
a=-123

In [18]:
b=str(a)

In [19]:
c=b[1:]
c

'123'

In [21]:
int('-'+c[::-1])

-321